jpablobr/jp-theme.org
#+TITLE: Theaming
#+OPTIONS: toc:nil H:2 num:nil ^:nil

This is part of the [[file:../init.el][jpablobr init.el]].

* Theaming config file
  Support for fonts.

** Load Packages
*** Load color theme tango-tango
(color-theme-twilight) (color-theme-topfunky) (color-theme-tangosoft)
(load-file (concat theaming-dir "/color-theme-tangotango/color-theme-tango.el"))
(load-file (concat theaming-dir "/color-theme-tangotango/color-theme-tangosoft.el"))

#+begin_src emacs-lisp
  (setq theaming-dir (concat vendor-dir "/theaming"))
  (load-file (concat theaming-dir "/color-theme-tangotango/color-theme-tangotango.el"))
  (color-theme-tangotango)
#+end_src

*** Transparency
;; Also see (transparency) and (reset-trasnparency) helper functions
;; (set-frame-parameter (selected-frame) 'alpha '(85 85))
;; (add-to-list 'default-frame-alist '(alpha 85 85))

*** Maxframe
(add-hook 'window-setup-hook 'ecb-redraw-layout t)
#+begin_src emacs-lisp
(require 'maxframe)
(add-hook 'window-setup-hook 'maximize-frame t)
#+end_src

*** Set default font. First one found is selected.
#+begin_src emacs-lisp
(cond
 ((eq window-system nil) nil)
 ((font-existsp "PragmataPro")
  (set-face-attribute 'default nil :font "PragmataPro"))
 ((font-existsp "Menlo")
  (set-face-attribute 'default nil :font "Menlo"))
 ((font-existsp "Consolas")
  (set-face-attribute 'default nil :font "Consolas"))
 ((font-existsp "Inconsolata")
  (set-face-attribute 'default nil :font "Inconsolata")))
#+end_src
